Revit 2026 API

# CheckoutStatus Enumeration

---

Indicates the ownership status of an element

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CheckoutStatus
```
```vb
Public Enumeration CheckoutStatus
```
```cpp
public enum class CheckoutStatus
```
```fsharp
type CheckoutStatus
```

| Member name | Value | Description |
| --- | --- | --- |
| NotOwned | 2 | The element is not owned by any user. |
| OwnedByCurrentUser | 0 | The element is owned by the current user. |
| OwnedByOtherUser | 1 | The element is owned by some user other than the current user. |

#### Reference

Autodesk.Revit.DB Namespace